<a href="https://colab.research.google.com/github/cynthia919/pandas/blob/main/pandas_columns.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Three ways to change the column index in pandas

In [1]:
import numpy as np
import pandas as pd

In [5]:
student = ['A','B','C','D','E']
column_name = ['Course1','Course2','Course3','Course4','Course5']
score = np.random.randint(0,high=100,size=(5,5))
df = pd.DataFrame(data=score, columns=column_name, index=student)
df

   Course1  Course2  Course3  Course4  Course5
A       71       47       37       87       75
B       42       42       23       15       24
C       30       73        6       25       82
D       32       20       66       61       41
E       58        9       19       37        2

* Reverse the columns

In [6]:
reversed_column_name = df.columns[::-1]
reversed_df = df[reversed_column_name]
reversed_df

   Course5  Course4  Course3  Course2  Course1
A       75       87       37       47       71
B       24       15       23       42       42
C       82       25        6       73       30
D       41       61       66       20       32
E        2       37       19        9       58

* Shift the last column to the first column

In [8]:
rolled_column_name = np.roll(df.columns,1) # np.roll(df.columns,-1) 
rolled_df = df[rolled_column_name]
rolled_df

   Course5  Course1  Course2  Course3  Course4
A       75       71       47       37       87
B       24       42       42       23       15
C       82       30       73        6       25
D       41       32       20       66       61
E        2       58        9       19       37

* Swap two columns

In [9]:
column_title = list(df.columns) 
column_title[-2], column_title[-1] = column_title[-1], column_title[-2]
swapped_df = df.reindex(columns=column_title)
swapped_df

   Course1  Course2  Course3  Course5  Course4
A       71       47       37       75       87
B       42       42       23       24       15
C       30       73        6       82       25
D       32       20       66       41       61
E       58        9       19        2       37